const messages = {
    name: 'Первая буква имени должна быть заглавной, цифры, пробелы и спецсимволы (кроме дефиса) недопустимы',
    login: 'Логин должен содержать от 3 до 20 символов без пробелов и спецсимволов (допустимы дефис и нижнее подчёркивание)',
    phone: 'Номер должен содержать от 10 до 15 символов, состоять из цифр, может начинается с плюса',
    mail: 'Адрес почты должен быть на латинице, может включать цифры и некоторые спецсимволы, плюс «собака» (@) и буквы с точкой после',
    password: 'Пароль должен содержать от 8 до 40 символов, и хотя бы одну заглавную букву и одну цифру',
    passwordCopy: 'Пароли должны совпадать',
    message: 'Поле не должно быть пустым'
};

export default { messages };
